Revit 2027 API
ParameterTypeId.StairstypeRightSideSupportType Property
 "Right Support Type": Right Side Support Type
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairstypeRightSideSupportType { get; }
Public Shared ReadOnly Property StairstypeRightSideSupportType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairstypeRightSideSupportType {
	ForgeTypeId^ get ();
}
static member StairstypeRightSideSupportType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace